In [1]:
import pandas as pd
import numpy as np

데이터 수집 -> 전처리 -> 분석 -> 시각화
데이터 수집 -> 전처리(시각화) -> 분석 -> 시각화 -> 알고리즘 선택 -> 모델링 -> 모델평가 및 개선
<--------------------------------------- 피드백 ------------------------------------->
tidy data(깔끔한 데이터)?
- 데이터 측정 목적에 부합한ㄴ 데이터 표(데이터 프레임)으로 작성
- 측정한 데이터는 행 단위로 구성(

In [ ]:
"""
결측값 여부? isnull or notnull함수
열 별 결측값? df.isnull().sum()
행 별 결측값? df.isnull().sum(axis=1)
"""

In [3]:
df = pd.DataFrame(np.arange(10).reshape(5,2),
            index=['a', 'b', 'c', 'd', 'e'],
            columns=["C1", "C2"])
df

   C1  C2
a   0   1
b   2   3
c   4   5
d   6   7
e   8   9

In [6]:
#b, e행 인덱스, C1열에 'None'저장
#b,c 행 인덱스, C2열에 'None'저장
df.loc[['b','e'],'C1'] = None
df.loc[['b','c'],'C2'] = None

In [7]:
df

    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

In [8]:
# sum,cumsum함수 -> NaN은 0취급
df.sum()

C1    10.0
C2    17.0
dtype: float64

In [11]:
#mean, std함수 -> NaN값 제외
print(df.mean())
print(df.std())

C1    3.333333
C2    5.666667
dtype: float64
C1    3.055050
C2    4.163332
dtype: float64

In [13]:
#데이터 프레임 서로 다른 컬럼간 연산시 : NaN이 있으면 NaN 출력됌
print(df)
df['C1']+df['C2']

    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

a     1.0
b     NaN
c     NaN
d    13.0
e     NaN
dtype: float64

In [15]:
#동일 컬럼이 없는 경우에는 모든 값을 NaN으로 반환
df2 = pd.DataFrame({'C1': [1,1,1,1,1],
                   'C4':[1,1,1,1,1]},
                  index=['a', 'b', 'c', 'd', 'e'])

In [18]:
print(df2)
print(df)
df+df2

   C1  C4
a   1   1
b   1   1
c   1   1
d   1   1
e   1   1
    C1   C2
a  0.0  1.0
b  NaN  NaN
c  4.0  NaN
d  6.0  7.0
e  NaN  9.0

    C1  C2  C4
a  1.0 NaN NaN
b  NaN NaN NaN
c  5.0 NaN NaN
d  7.0 NaN NaN
e  NaN NaN NaN

In [ ]:
#결측값 처리(대체): df.fillna()

In [19]:
df = pd.DataFrame(np.random.randn(5,3),
                 columns=['c1', 'c2', 'c3'])
df

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1  1.094842  0.032934 -0.097261
2 -0.754521  1.174087  1.015076
3  1.296652 -0.005938  0.597092
4 -1.217796 -1.358129  0.086571

In [20]:
df.loc[1, ['c1', 'c3']] = None
df

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1       NaN  0.032934       NaN
2 -0.754521  1.174087  1.015076
3  1.296652 -0.005938  0.597092
4 -1.217796 -1.358129  0.086571

In [21]:
df.loc[2, 'c2'] = np.nan
df

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1       NaN  0.032934       NaN
2 -0.754521       NaN  1.015076
3  1.296652 -0.005938  0.597092
4 -1.217796 -1.358129  0.086571

In [22]:
df.loc[3, 'c2'] = np.nan
df.loc[4, 'c3'] = np.nan

In [23]:
df

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1       NaN  0.032934       NaN
2 -0.754521       NaN  1.015076
3  1.296652       NaN  0.597092
4 -1.217796 -1.358129       NaN

In [24]:
dfMissing = df.fillna('missing')
dfMissing

         c1         c2        c3
0  0.773372  -0.629592 -0.849899
1   missing  0.0329338   missing
2 -0.754521    missing   1.01508
3   1.29665    missing  0.597092
4   -1.2178   -1.35813   missing

In [ ]:
#df.fillna(method='ffill') #또는 bfill

In [25]:
df

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1       NaN  0.032934       NaN
2 -0.754521       NaN  1.015076
3  1.296652       NaN  0.597092
4 -1.217796 -1.358129       NaN

In [26]:
df.mean()

c1    0.024427
c2   -0.651596
c3    0.254090
dtype: float64

In [28]:
df.fillna(df.mean()) #각 열의 평균값으로 na가 대체

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1  0.024427  0.032934  0.254090
2 -0.754521 -0.651596  1.015076
3  1.296652 -0.651596  0.597092
4 -1.217796 -1.358129  0.254090

In [33]:
#np.where함수를 이용하여 위와 같은 결과를 출력하시오.
np.where(df.isnull(), df.mean(), df)

          0         1         2
0  0.773372 -0.629592 -0.849899
1  0.024427  0.032934  0.254090
2 -0.754521 -0.651596  1.015076
3  1.296652 -0.651596  0.597092
4 -1.217796 -1.358129  0.254090

In [37]:
#pandas의where이용 -> 데이터프레임, 시리즈 모두 where함수 사용법 동일
df.where(df.notnull(), df.mean(), inplace=False, axis=1) #df.where(pd.notnull(df), df.mean(), axis='column')

         c1        c2        c3
0  0.773372 -0.629592 -0.849899
1  0.024427  0.032934  0.254090
2 -0.754521 -0.651596  1.015076
3  1.296652 -0.651596  0.597092
4 -1.217796 -1.358129  0.254090

In [44]:
df2 = pd.DataFrame({'c1': [1,2,3,4,5], 'c2': [6,7,8,9,10]})
df2

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [45]:
df2.loc[[1,3],['c2']] = np.nan

In [46]:
df2

   c1    c2
0   1   6.0
1   2   NaN
2   3   8.0
3   4   NaN
4   5  10.0

In [ ]:
df2['c2new'] = np.where(pd.notnull(df2['c2']). df2['c2'])